# Introduction to Pandas in Python

Pandas is a fast, powerful, flexible and easy to use open source tool for data analysis and manipulation, built on top of the Python programming language.


For more infos, see: https://pandas.pydata.org

## Installation

`pip install pandas`

## Getting started
To load the pandas package and start working with it, import the package.

In [148]:
# Import required library
import pandas as pd

# Check version
pd.__version__

'1.1.3'

Now you are ready to use pandas, and you can write your code in the next cells.

Pandas provides the <code>read_csv()</code> function to read data stored as a csv file into a pandas DataFrame. pandas supports many different file formats or data sources out of the box (csv, excel, sql, json, parquet, â€¦), each of them with the prefix read_*.

In [ ]:
# Read data from CSV file
csv_path = 'https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-PY0101EN-SkillsNetwork/labs/Module%204/data/TopSellingAlbums.csv'
df = pd.read_csv(csv_path)

# Read data from Excel File and print the first five rows
xlsx_path = 'https://s3-api.us-geo.objectstorage.softlayer.net/cf-courses-data/CognitiveClass/PY0101EN/Chapter%204/Datasets/TopSellingAlbums.xlsx'
df = pd.read_excel(xlsx_path)

## View data

<b>About the Dataset</b> - The table has one row for each artist and several columns:

<ul>
    <li><b>artist</b>: Name of the artist</li>
    <li><b>album</b>: Name of the album</li>
    <li><b>released_year</b>: Year the album was released</li>
    <li><b>length_min_sec</b>: Length of the album (hours,minutes,seconds)</li>
    <li><b>genre</b>: Genre of the album</li>
    <li><b>music_recording_sales_millions</b>: Music recording sales (millions in USD) on <a href="http://www.song-database.com/?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkPY0101ENSkillsNetwork19487395-2021-01-01?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkPY0101ENSkillsNetwork19487395-2021-01-01">[SONG://DATABASE]</a></li>
    <li><b>claimed_sales_millions</b>: Album's claimed sales (millions in USD) on <a href="http://www.song-database.com/">[SONG://DATABASE]</a></li>
    <li><b>date_released</b>: Date on which the album was released</li>
    <li><b>soundtrack</b>: Indicates if the album is the movie soundtrack (Y) or (N)</li>
    <li><b>rating_of_friends</b>: Indicates the rating from your friends from 1 to 10</li>
</ul>

We can use the method <code>head()</code> to examine the first five rows of a dataframe:

In [151]:
# Print first five rows of the dataframe
df.head()
# df.tail(10)

,Artist,Album,Released,Length,Genre,Music Recording Sales (millions),Claimed Sales (millions),Released.1,Soundtrack,Rating
0,Michael Jackson,Thriller,1982,0:42:19,"pop, rock, R&B",46.0,65,30-Nov-82,NaN,10.0
1,AC/DC,Back in Black,1980,0:42:11,hard rock,26.1,50,25-Jul-80,NaN,9.5
2,Pink Floyd,The Dark Side of the Moon,1973,0:42:49,progressive rock,24.2,45,01-Mar-73,NaN,9.0
3,Whitney Houston,The Bodyguard,1992,0:57:44,"R&B, soul, pop",27.4,44,17-Nov-92,Y,8.5
4,Meat Loaf,Bat Out of Hell,1977,0:46:33,"hard rock, progressive rock",20.6,43,21-Oct-77,NaN,8.0

We can use the method <code>info()</code> to get a summary of a dataframe:

In [152]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 10 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   Artist                            8 non-null      object
 1   Album                             8 non-null      object
 2   Released                          8 non-null      int64
 3   Length                            8 non-null      object
 4   Genre                             8 non-null      object
 5   Music Recording Sales (millions)  8 non-null      float64
 6   Claimed Sales (millions)          8 non-null      int64
 7   Released.1                        8 non-null      object
 8   Soundtrack                        2 non-null      object
 9   Rating                            8 non-null      float64
dtypes: float64(2), int64(2), object(6)
memory usage: 768.0+ bytes

The <code>describe()</code> method provides a quick overview of the numerical data in a DataFrame. As f.e. the Artist and Albums columns are textual data, these are by default not taken into account by the <code>describe()</code> method.

In [153]:
df.describe()

,Released,Music Recording Sales (millions),Claimed Sales (millions),Rating
count,8.000000,8.000000,8.000000,8.000000
mean,1979.250000,28.125000,46.125000,8.250000
std,5.800246,8.189322,8.271077,1.224745
min,1973.000000,20.600000,40.000000,6.500000
25%,1976.750000,23.300000,41.500000,7.375000
50%,1977.000000,26.750000,43.500000,8.250000
75%,1980.500000,28.975000,46.250000,9.125000
max,1992.000000,46.000000,65.000000,10.000000

## Data structures
The two primary data structures of pandas are:


- DataFrame: A DataFrame is a 2-dimensional data structure that can store data of different types (including characters, integers, floating point values, categorical data and more) in columns. It is similar to a spreadsheet, a SQL table or the data.frame in R.
- Series: Each column in a DataFrame is a 1-dimensional Series. To select the column, use the column label in between square brackets [].

## Selection

### How do I select specific columns from a DataFrame?

You can get a column as a series. You can think of a Pandas series as a 1-D dataframe. Just use one bracket:

In [157]:
# Get the column as a series
x = df['Album']
x
# type(x)

pandas.core.series.Series

You can also get a column as a dataframe. For example, we can access the column <b>Artist</b> and assign it a new dataframe <b>x</b>:

In [158]:
# Get the column as a dataframe
x = df[['Artist']]
x
# type(x)

            Artist
0  Michael Jackson
1            AC/DC
2       Pink Floyd
3  Whitney Houston
4        Meat Loaf
5           Eagles
6         Bee Gees
7    Fleetwood Mac

To select multiple columns, use a list of column names within the selection brackets []. Note: The inner square brackets define a Python list with column names, whereas the outer brackets are used to select the data from a pandas DataFrame as seen in the previous example.

The result is a new dataframe comprised of the specified columns:

In [104]:
# Access to multiple columns
y = df[['Artist','Length','Genre']]
y

            Artist    Length                        Genre
0  Michael Jackson  00:42:19               pop, rock, R&B
1            AC/DC  00:42:11                    hard rock
2       Pink Floyd  00:42:49             progressive rock
3  Whitney Houston  00:57:44               R&B, soul, pop
4        Meat Loaf  00:46:33  hard rock, progressive rock
5           Eagles  00:43:08   rock, soft rock, folk rock
6         Bee Gees  01:15:54                        disco
7    Fleetwood Mac  00:40:01                    soft rock

### How do I filter specific rows from a DataFrame?

In [161]:
# Select roww
MJ = df[df["Artist"] == "Michael Jackson"]
MJ
# type(MJ)

,Artist,Album,Released,Length,Genre,Music Recording Sales (millions),Claimed Sales (millions),Released.1,Soundtrack,Rating
0,Michael Jackson,Thriller,1982,0:42:19,"pop, rock, R&B",46.0,65,30-Nov-82,NaN,10.0

To select rows based on a conditional expression, use a condition inside the selection brackets [].

In [105]:
# Select rows based on a conditional expression
above_1980 = df[df["Released"] > 1980]
above_1980

,Artist,Album,Released,Length,Genre,Music Recording Sales (millions),Claimed Sales (millions),Released.1,Soundtrack,Rating
0,Michael Jackson,Thriller,1982,00:42:19,"pop, rock, R&B",46.0,65,1982-11-30,NaN,10.0
3,Whitney Houston,The Bodyguard,1992,00:57:44,"R&B, soul, pop",27.4,44,1992-11-17,Y,8.5

The condition inside the selection brackets df["Released"] > 1980 checks for which rows the Released column has a value larger than 1980.

Note: The output of the conditional expression (>, but also ==, !=, <, <=,â€¦ would work) is actually a pandas Series of boolean values (either True or False) with the same number of rows as the original DataFrame. Such a Series of boolean values can be used to filter the DataFrame by putting it in between the selection brackets []. Only rows for which the value is True will be selected.

When combining multiple conditional statements, each condition must be surrounded by parentheses (). Moreover, you can not use or/and but need to use the or operator | and the and operator &.

In [106]:
# Combining multiple conditional statements
x = df[(df["Released"] > 1980) & (df["Artist"] == "Michael Jackson")]
x

,Artist,Album,Released,Length,Genre,Music Recording Sales (millions),Claimed Sales (millions),Released.1,Soundtrack,Rating
0,Michael Jackson,Thriller,1982,00:42:19,"pop, rock, R&B",46.0,65,1982-11-30,NaN,10.0

### How do I select specific rows and columns from a DataFrame?

In this case, a subset of both rows and columns is made in one go and just using selection brackets [] is not sufficient anymore. The  <code>loc/iloc</code> operators are required in front of the selection brackets []. 

- Select specific rows and/or columns using <code>loc</code> when using the row and column names
- Select specific rows and/or columns using <code>iloc</code> when using the positions in the table


When using <code>loc/iloc</code>, the part before the comma is the rows you want, and the part after the comma is the columns you want to select. Inside these brackets, you can use a single column/row label, a list of column/row labels, a slice of labels, a conditional expression or a colon.

In [107]:
# Access the column using the name
df.loc[0, 'Artist']

'Michael Jackson'

In [162]:
# Access the column with new index
df_ABC = pd.DataFrame({'A': [11, 21, 31],
                   'B': [12, 22, 32],
                   'C': [13, 23, 33]})
df_ABC.index=['ONE', 'TWO', 'THREE']
df_ABC.loc['ONE','A']

11

In [110]:
# Select all the names of the Albums of the year 1977
df.loc[df["Released"] == 1977, "Album"]

4         Bat Out of Hell
6    Saturday Night Fever
7                 Rumours
Name: Album, dtype: object

In [111]:
# Select rows 1 till 5 and columns 3 to 5.
df.iloc[0:5, 2:5]

   Released    Length                        Genre
0      1982  00:42:19               pop, rock, R&B
1      1980  00:42:11                    hard rock
2      1973  00:42:49             progressive rock
3      1992  00:57:44               R&B, soul, pop
4      1977  00:46:33  hard rock, progressive rock

When selecting specific rows and/or columns with loc or iloc, new values can be assigned to the selected data. For example, to assign the name anonymous to the first 3 elements of the third column:

In [163]:
df.iloc[0:3, 0] = "anonymous"
df.head()

,Artist,Album,Released,Length,Genre,Music Recording Sales (millions),Claimed Sales (millions),Released.1,Soundtrack,Rating
0,anonymous,Thriller,1982,0:42:19,"pop, rock, R&B",46.0,65,30-Nov-82,NaN,10.0
1,anonymous,Back in Black,1980,0:42:11,hard rock,26.1,50,25-Jul-80,NaN,9.5
2,anonymous,The Dark Side of the Moon,1973,0:42:49,progressive rock,24.2,45,01-Mar-73,NaN,9.0
3,Whitney Houston,The Bodyguard,1992,0:57:44,"R&B, soul, pop",27.4,44,17-Nov-92,Y,8.5
4,Meat Loaf,Bat Out of Hell,1977,0:46:33,"hard rock, progressive rock",20.6,43,21-Oct-77,NaN,8.0

## Operations
Different statistics are available and can be applied to columns with numerical data. Operations in general exclude missing data.

In [172]:
df.mean()

Released                            1979.250
Music Recording Sales (millions)      28.125
Claimed Sales (millions)              46.125
Rating                                 8.250
dtype: float64

In [173]:
df.median()

Released                            1977.00
Music Recording Sales (millions)      26.75
Claimed Sales (millions)              43.50
Rating                                 8.25
dtype: float64

In [185]:
df.describe()

,Released,Music Recording Sales (millions),Claimed Sales (millions),Rating
count,8.000000,8.000000,8.000000,8.000000
mean,1979.250000,28.125000,46.125000,8.250000
std,5.800246,8.189322,8.271077,1.224745
min,1973.000000,20.600000,40.000000,6.500000
25%,1976.750000,23.300000,41.500000,7.375000
50%,1977.000000,26.750000,43.500000,8.250000
75%,1980.500000,28.975000,46.250000,9.125000
max,1992.000000,46.000000,65.000000,10.000000

The <code>value_counts()</code> method counts the number of records for each category in a column

In [186]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    4
1    2
2    6
3    4
4    1
5    4
6    6
7    6
8    6
9    5
dtype: int64

In [187]:
s.value_counts()

6    4
4    3
5    1
2    1
1    1
dtype: int64

Aggregating statistics grouped by category:

In [188]:
df[["Artist", "Rating"]].groupby("Artist").mean()

                 Rating
Artist
Bee Gees            7.0
Eagles              7.5
Fleetwood Mac       6.5
Meat Loaf           8.0
Whitney Houston     8.5
anonymous           9.5

As our interest is the average age for each gender, a subselection on these two columns is made first: titanic[["Artist", "Rating"]]. Next, the <code>groupby()</code> method is applied on the Artist column to make a group per category. The average age for each gender is calculated and returned.

In [189]:
df.groupby("Artist")["Rating"].mean()

Artist
Bee Gees           7.0
Eagles             7.5
Fleetwood Mac      6.5
Meat Loaf          8.0
Whitney Houston    8.5
anonymous          9.5
Name: Rating, dtype: float64

In [190]:
## Missing data

In [191]:
# Creating a DataFrame with missings
dates = pd.date_range("20130101", periods=6)
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])
df1.loc[dates[0] : dates[1], "E"] = 1
df1

                   A         B         C         D    E
2013-01-01 -2.802867 -1.343115 -0.045375 -0.617445  1.0
2013-01-02  0.736969  0.514580  0.387597 -0.152742  1.0
2013-01-03  0.515179 -1.500016 -0.079509 -0.040821  NaN
2013-01-04 -1.346333 -0.761828 -0.428536 -0.209336  NaN

To drop any rows that have missing data.

In [192]:
df1.dropna(how="any")

                   A         B         C         D    E
2013-01-01 -2.802867 -1.343115 -0.045375 -0.617445  1.0
2013-01-02  0.736969  0.514580  0.387597 -0.152742  1.0

Filling missing data.

In [193]:
df1.fillna(value=5)

                   A         B         C         D    E
2013-01-01 -2.802867 -1.343115 -0.045375 -0.617445  1.0
2013-01-02  0.736969  0.514580  0.387597 -0.152742  1.0
2013-01-03  0.515179 -1.500016 -0.079509 -0.040821  5.0
2013-01-04 -1.346333 -0.761828 -0.428536 -0.209336  5.0

In [194]:
df1

                   A         B         C         D    E
2013-01-01 -2.802867 -1.343115 -0.045375 -0.617445  1.0
2013-01-02  0.736969  0.514580  0.387597 -0.152742  1.0
2013-01-03  0.515179 -1.500016 -0.079509 -0.040821  NaN
2013-01-04 -1.346333 -0.761828 -0.428536 -0.209336  NaN

To get the boolean mask where values are nan.

In [195]:
pd.isna(df1)

                A      B      C      D      E
2013-01-01  False  False  False  False  False
2013-01-02  False  False  False  False  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False  False  False   True

## Getting data in/out
Writing to a csv/excel file.

In [196]:
df.to_csv("table1.csv")
df.to_excel("table1.xlsx", sheet_name="Sheet1")

Reading from a csv file.

In [197]:
pd.read_csv("table1.csv")

   Unnamed: 0         A         B         C         D
0  2013-01-01 -2.802867 -1.343115 -0.045375 -0.617445
1  2013-01-02  0.736969  0.514580  0.387597 -0.152742
2  2013-01-03  0.515179 -1.500016 -0.079509 -0.040821
3  2013-01-04 -1.346333 -0.761828 -0.428536 -0.209336
4  2013-01-05 -0.306303 -0.123927  1.369606 -0.836257
5  2013-01-06  0.594857 -0.092012 -0.428964 -0.035449

## Tutorials
How to calculate summary statistics?

https://pandas.pydata.org/docs/getting_started/intro_tutorials/06_calculate_statistics.html

How to reshape the layout of tables?

https://pandas.pydata.org/docs/getting_started/intro_tutorials/07_reshape_table_layout.html

How to combine data from multiple tables?

https://pandas.pydata.org/docs/getting_started/intro_tutorials/08_combine_dataframes.html

See also: https://pandas.pydata.org/docs/user_guide/10min.html